In [1]:
import pandas as pd
from sklearn import tree
from sklearn.preprocessing import LabelEncoder
from sklearn.model_selection import train_test_split

In [2]:
df = pd.read_csv('titanic.csv')

In [3]:
df.head(5)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [4]:
df2 = df.copy()

In [5]:
df2.drop(['PassengerId','Name','SibSp','Parch','Ticket','Cabin','Embarked'],axis = 'columns',inplace = True)

In [7]:
df2.columns

Index(['Survived', 'Pclass', 'Sex', 'Age', 'Fare'], dtype='object')

In [40]:
target = df2.Survived
target.head(5)

0    0
1    1
2    1
3    1
4    0
Name: Survived, dtype: int64

In [17]:
le = LabelEncoder()

In [27]:
inputs.Sex = le.fit_transform(inputs.Sex)

In [28]:
inputs.Sex.head(5)

0    1
1    0
2    0
3    0
4    1
Name: Sex, dtype: int64

In [29]:
inputs.head()

   Pclass  Sex   Age     Fare
0       3    1  22.0   7.2500
1       1    0  38.0  71.2833
2       3    0  26.0   7.9250
3       1    0  35.0  53.1000
4       3    1  35.0   8.0500

In [30]:
target.head(5)

0    0
1    1
2    1
3    1
4    0
Name: Survived, dtype: int64

In [32]:
df2.isnull().sum()

Survived      0
Pclass        0
Sex           0
Age         177
Fare          0
dtype: int64

In [36]:
mean_age = inputs.Age.mean()
mean_age

29.69911764705882

In [37]:
inputs.Age = inputs.Age.fillna(mean_age)

In [42]:
inputs.isnull().sum()

Pclass    0
Sex       0
Age       0
Fare      0
dtype: int64

In [43]:
X_train, X_test, y_train, y_test = train_test_split(inputs,target,test_size=0.2)

In [44]:
len(X_train)

712

In [45]:
len(X_test)

179

In [46]:
model = tree.DecisionTreeClassifier()

In [47]:
model.fit(X_train,y_train)

DecisionTreeClassifier()

In [49]:
model.score(X_test,y_test)

0.7486033519553073

In [54]:
y_test.head(5)

137    0
882    0
473    1
54     0
215    1
Name: Survived, dtype: int64

In [55]:
X_test.head(5)

     Pclass  Sex   Age      Fare
137       1    1  37.0   53.1000
882       3    0  22.0   10.5167
473       2    0  23.0   13.7917
54        1    1  65.0   61.9792
215       1    0  31.0  113.2750

In [57]:
model.predict(X_test.head(5))

array([1, 0, 1, 1, 1], dtype=int64)